const zx = require('../libs/zhixin');
import Http from '../libs/Http'
import Data from '../libs/business/data'

zx.setUp({
    showHeader: false,
    requestType: Http.TYPE.v11,
    data: Data.v11
});

require('./main.css')

const Vue = require('vue');
const VueRouter = require('vue-router');
const Util = require('Util');

zx.data.productID = Util.getRequestParam("productID");
zx.data.regionType = Util.getRequestParam("regionType");
zx.data.regionID = Util.getRequestParam("regionID");

//=======================mock====================
import setInterceptor from '../libs/InterceptHttp'
setInterceptor(function (requestParams) {
    if (requestParams.functionName == 'getQueryID_ZX') {
        // requestParams.success({
        //     "dataList": "[{\"queryid\":\"1002\"},{\"queryid\":\"1004\"},{\"queryid\":\"1010\"},{\"queryid\":\"1028\"},{\"queryid\":\"1015\"},{\"queryid\":\"1017\"},{\"queryid\":\"1018\"},{\"queryid\":\"1020\"},{\"queryid\":\"1021\"},{\"queryid\":\"1022\"},{\"queryid\":\"1016\"},{\"queryid\":\"1029\"},{\"queryid\":\"1030\"},{\"queryid\":\"1031\"},{\"queryid\":\"1032\"},{\"queryid\":\"1033\"},{\"queryid\":\"1034\"},{\"queryid\":\"1035\"},{\"queryid\":\"1036\"},{\"queryid\":\"1037\"},{\"queryid\":\"1038\"},{\"queryid\":\"1039\"},{\"queryid\":\"1040\"},{\"queryid\":\"1041\"},{\"queryid\":\"1042\"},{\"queryid\":\"1043\"},{\"queryid\":\"1060\"},{\"queryid\":\"1069\"},{\"queryid\":\"1073\"},{\"queryid\":\"1074\"},{\"queryid\":\"4008\"},{\"queryid\":\"4009\"}]",
        //     "errorDesc": "4003_1038_1023_1021_1019_1018_1017_",
        //     "errorCode": 0
        // })
        return false
    } else if (requestParams.functionName == 'getUniStatData_ZX') {
        // requestParams.success({
        //     "dataList": "[{\"f\":\"100%\",\"g\":\"1\",\"d\":\"7\",\"e\":\"7\",\"b\":\"公共设施\",\"c\":\"电力(电缆)井盖\",\"a\":\"部件\",\"j\":\"0\",\"h\":\"0\",\"i\":\"0%\"},{\"f\":\"42.86%\",\"g\":\"2\",\"d\":\"7\",\"e\":\"3\",\"b\":\"公共设施\",\"c\":\"污水井盖\",\"a\":\"部件\",\"j\":\"0\",\"h\":\"2\",\"i\":\"100%\"},{\"f\":\"100%\",\"g\":\"4\",\"d\":\"5\",\"e\":\"5\",\"b\":\"公共设施\",\"c\":\"雨水箅子\",\"a\":\"部件\",\"j\":\"0\",\"h\":\"2\",\"i\":\"50%\"},{\"f\":\"80%\",\"g\":\"0\",\"d\":\"5\",\"e\":\"4\",\"b\":\"公共设施\",\"c\":\"通讯交接箱\",\"a\":\"部件\",\"j\":\"0\",\"h\":\"0\",\"i\":\"0%\"},{\"f\":\"75%\",\"g\":\"2\",\"d\":\"4\",\"e\":\"3\",\"b\":\"市容环境\",\"c\":\"垃圾箱\",\"a\":\"部件\",\"j\":\"0\",\"h\":\"2\",\"i\":\"100%\"},{\"f\":\"33.33%\",\"g\":\"0\",\"d\":\"3\",\"e\":\"1\",\"b\":\"公共设施\",\"c\":\"景观灯\",\"a\":\"部件\",\"j\":\"0\",\"h\":\"0\",\"i\":\"0%\"},{\"f\":\"100%\",\"g\":\"0\",\"d\":\"2\",\"e\":\"2\",\"b\":\"道路交通\",\"c\":\"交通标志牌\",\"a\":\"部件\",\"j\":\"0\",\"h\":\"0\",\"i\":\"0%\"},{\"f\":\"100%\",\"g\":\"2\",\"d\":\"2\",\"e\":\"2\",\"b\":\"公共设施\",\"c\":\"上水井盖(消防)\",\"a\":\"部件\",\"j\":\"0\",\"h\":\"0\",\"i\":\"0%\"},{\"f\":\"100%\",\"g\":\"1\",\"d\":\"2\",\"e\":\"2\",\"b\":\"市容环境\",\"c\":\"LED广告屏、牌\",\"a\":\"部件\",\"j\":\"0\",\"h\":\"0\",\"i\":\"0%\"},{\"f\":\"100%\",\"g\":\"0\",\"d\":\"2\",\"e\":\"2\",\"b\":\"道路交通\",\"c\":\"交通信号灯\",\"a\":\"部件\",\"j\":\"0\",\"h\":\"0\",\"i\":\"0%\"},{\"f\":\"0%\",\"g\":\"0\",\"d\":\"2\",\"e\":\"0\",\"b\":\"公共设施\",\"c\":\"无主井盖\",\"a\":\"部件\",\"j\":\"0\",\"h\":\"0\",\"i\":\"0%\"},{\"f\":\"100%\",\"g\":\"0\",\"d\":\"1\",\"e\":\"1\",\"b\":\"道路交通\",\"c\":\"减速带\",\"a\":\"部件\",\"j\":\"0\",\"h\":\"0\",\"i\":\"0%\"},{\"f\":\"100%\",\"g\":\"0\",\"d\":\"1\",\"e\":\"1\",\"b\":\"公共设施\",\"c\":\"通讯井盖\",\"a\":\"部件\",\"j\":\"0\",\"h\":\"0\",\"i\":\"0%\"},{\"f\":\"100%\",\"g\":\"1\",\"d\":\"1\",\"e\":\"1\",\"b\":\"公共设施\",\"c\":\"报刊亭\",\"a\":\"部件\",\"j\":\"0\",\"h\":\"0\",\"i\":\"0%\"},{\"f\":\"100%\",\"g\":\"0\",\"d\":\"1\",\"e\":\"1\",\"b\":\"道路交通\",\"c\":\"出租车站亭(牌)\",\"a\":\"部件\",\"j\":\"0\",\"h\":\"0\",\"i\":\"0%\"},{\"f\":\"100%\",\"g\":\"0\",\"d\":\"1\",\"e\":\"1\",\"b\":\"公共设施\",\"c\":\"路灯\",\"a\":\"部件\",\"j\":\"0\",\"h\":\"0\",\"i\":\"0%\"},{\"f\":\"100%\",\"g\":\"0\",\"d\":\"1\",\"e\":\"1\",\"b\":\"公共设施\",\"c\":\"电表箱\",\"a\":\"部件\",\"j\":\"0\",\"h\":\"0\",\"i\":\"0%\"},{\"f\":\"0%\",\"g\":\"0\",\"d\":\"1\",\"e\":\"0\",\"b\":\"公共设施\",\"c\":\"雨水井盖\",\"a\":\"部件\",\"j\":\"0\",\"h\":\"0\",\"i\":\"0%\"},{\"f\":\"77.08%\",\"g\":\"13\",\"d\":\"48\",\"e\":\"37\",\"b\":\"\",\"c\":\"\",\"a\":\"总计\",\"j\":\"0\",\"h\":\"6\",\"i\":\"46.15%\"}]",
        //     "errorDesc": "操作失败.",
        //     "errorCode": 0,
        //     "resultStr": "<HeadStr>问题类型,大类,小类,上报数,立案数,立案率,应结案数,结案数,结案率,作废数#问题类型#大类#小类</HeadStr><HeadStrEN>a,b,c,d,e,f,g,h,i,j</HeadStrEN><ResultSet><row><a>部件</a><b>公共设施</b><c>电力(电缆)井盖</c><d>7</d><e>7</e><f>100%</f><g>1</g><h>0</h><i>0%</i><j>0</j></row><row><a>部件</a><b>公共设施</b><c>污水井盖</c><d>7</d><e>3</e><f>42.86%</f><g>2</g><h>2</h><i>100%</i><j>0</j></row><row><a>部件</a><b>公共设施</b><c>雨水箅子</c><d>5</d><e>5</e><f>100%</f><g>4</g><h>2</h><i>50%</i><j>0</j></row><row><a>部件</a><b>公共设施</b><c>通讯交接箱</c><d>5</d><e>4</e><f>80%</f><g>0</g><h>0</h><i>0%</i><j>0</j></row><row><a>部件</a><b>市容环境</b><c>垃圾箱</c><d>4</d><e>3</e><f>75%</f><g>2</g><h>2</h><i>100%</i><j>0</j></row><row><a>部件</a><b>公共设施</b><c>景观灯</c><d>3</d><e>1</e><f>33.33%</f><g>0</g><h>0</h><i>0%</i><j>0</j></row><row><a>部件</a><b>道路交通</b><c>交通标志牌</c><d>2</d><e>2</e><f>100%</f><g>0</g><h>0</h><i>0%</i><j>0</j></row><row><a>部件</a><b>公共设施</b><c>上水井盖(消防)</c><d>2</d><e>2</e><f>100%</f><g>2</g><h>0</h><i>0%</i><j>0</j></row><row><a>部件</a><b>市容环境</b><c>LED广告屏、牌</c><d>2</d><e>2</e><f>100%</f><g>1</g><h>0</h><i>0%</i><j>0</j></row><row><a>部件</a><b>道路交通</b><c>交通信号灯</c><d>2</d><e>2</e><f>100%</f><g>0</g><h>0</h><i>0%</i><j>0</j></row><row><a>部件</a><b>公共设施</b><c>无主井盖</c><d>2</d><e>0</e><f>0%</f><g>0</g><h>0</h><i>0%</i><j>0</j></row><row><a>部件</a><b>道路交通</b><c>减速带</c><d>1</d><e>1</e><f>100%</f><g>0</g><h>0</h><i>0%</i><j>0</j></row><row><a>部件</a><b>公共设施</b><c>通讯井盖</c><d>1</d><e>1</e><f>100%</f><g>0</g><h>0</h><i>0%</i><j>0</j></row><row><a>部件</a><b>公共设施</b><c>报刊亭</c><d>1</d><e>1</e><f>100%</f><g>1</g><h>0</h><i>0%</i><j>0</j></row><row><a>部件</a><b>道路交通</b><c>出租车站亭(牌)</c><d>1</d><e>1</e><f>100%</f><g>0</g><h>0</h><i>0%</i><j>0</j></row><row><a>部件</a><b>公共设施</b><c>路灯</c><d>1</d><e>1</e><f>100%</f><g>0</g><h>0</h><i>0%</i><j>0</j></row><row><a>部件</a><b>公共设施</b><c>电表箱</c><d>1</d><e>1</e><f>100%</f><g>0</g><h>0</h><i>0%</i><j>0</j></row><row><a>部件</a><b>公共设施</b><c>雨水井盖</c><d>1</d><e>0</e><f>0%</f><g>0</g><h>0</h><i>0%</i><j>0</j></row><row><a>总计</a><b></b><c></c><d>48</d><e>37</e><f>77.08%</f><g>13</g><h>6</h><i>46.15%</i><j>0</j></row></ResultSet>"
        // })
        return false
    }
    return true
})
//===============================================

const Home = require('./view/Home.vue');
const Result = require('./view/Result.vue');
const Condition = require('./view/Condition.vue');
const Chart = require('./view/Chart.vue');

const router = new VueRouter({
    scrollBehavior: () => ({x: 0, y: 0}),
    routes: [
        {path: '/', redirect: '/home'},
        {path: '/home', name: 'home', component: Home},
        {path: '/result', name: 'result', component: Result},
        {path: '/condition', name: 'condition', component: Condition},
        {path: '/chart', name: 'chart', component: Chart}
    ]
});

zx.setUpBackHandler(router, Util.getHash());

new Vue({
    router
}).$mount('#app');

